papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/3dTube/0/fluid.pimpleFluid/time-series
(
    (0      1.3332)
    (3e-3   1.3332)
    (3.1e-3 0)
    (1e-2   0)
)
